package com.pay.typay.biz.messages;

public class ConstantsSelectUI {
    public String WorkType = "{\"\":\"请选择\",\"1\":\"收款\",\"2\":\"出款\",\"3\":\"中转\",\"4\":\"下发\",\"5\":\"手动出款\"," +
            "\"6\":\"风云出款\",\"7\":\"风云入款\",\"8\":\"结汇\",\"9\":\"第三方\",\"10\":\"第四方\",\"11\":\"技术支持\",\"12\":\"U盾\"," +
            "\"14\":\"小下发\" }";
    public String BankWorkType = "{\"\":\"请选择\",\"1\":\"收款\",\"2\":\"出款\",\"3\":\"中转\",\"4\":\"下发\",\"5\":\"手动出款\"," +
            "\"8\":\"结汇\",\"9\":\"第三方\",\"10\":\"第四方\",\"12\":\"U盾\"," +
            "\"14\":\"小下发\" }";
    public String WorkTypemonitor = "{\"\":\"请选择\",\"1\":\"收款\",\"2\":\"出款\",\"3\":\"中转\",\"4\":\"下发\",\"5\":\"手动出款\"}";

    public String WorkTypecreate = "{\"1\":\"收款\",\"2\":\"出款\",\"3\":\"中转\",\"4\":\"下发\",\"5\":\"手动出款\"," +
            "\"6\":\"风云出款\",\"7\":\"风云入款\",\"8\":\"结汇\",\"9\":\"第三方\",\"10\":\"第四方\",\"11\":\"技术支持\",\"12\":\"U盾\", \"14\":\"小下发\"}";
    public String cardWorkType = "{\"\":\"请选择\",\"0\":\"支付卡池\",\"1\":\"缓冲卡池\",\"2\":\"储蓄卡池\",\"3\":\"测试卡池\"}";
    public String Status = "{\"0\":\"停用\",\"1\":\"启用\",\"100\":\"在线\",\"-1\":\"软删除\",\"-2\":\"预启用\",\"-3\":\"交易限额停用\",\"-4\":\"余额超额停用\",\"-5\":\"交易笔数超额停用\",\"-6\":\"未设置转出卡\",\"-7\":\"异常\",\"-8\":\"临时停用\",\"-9\":\"已提走\",\"-10\":\"连接中\"}";
    public String Statussearch = "{\"0\":\"停用\",\"1\":\"启用\",\"100\":\"在线\",\"\":\"状态\",\"-1\":\"软删除\"," +
            "\"-2\":\"预启用\",\"-3\":\"交易限额停用\",\"-4\":\"余额超额停用\",\"-5\":\"交易笔数超额停用\",\"-6\":\"未设置转出卡\"," +
            "\"-8\":\"临时停用\",\"-7\":\"异常\",\"-9\":\"已提走\" }";
    public String CardpoolStatus = "{\"\":\"请选择\",\"0\":\"停用\",\"1\":\"启用\"}";

    public String TransStatus = "{\"\":\"请选择\",\"0\":\"创建\",\"1\":\"处理中\",\"2\":\"成功处理\",\"3\":\"异常\"}";
    public String TransType = "{\"\":\"请选择\",\"0\":\"支出\",\"1\":\"收入\",\"2\":\"内转\"}";
    public String TransOrderType = "{\"\":\"请选择\",\"1\":\"存款交易流水\",\"0\":\"提款交易流水\",\"3\":\"内转交易流水\",\"4\":\"测卡交易流水\"}";
    public String PayType = "{\"\":\"请选择\",\"0\":\"网银转账\",\"1\":\"银行卡转账\",\"2\":\"银联快捷\",\"3\":\"微信\",\"4\":\"支付宝\",\"5\":\"QQ钱包\",\"6\":\"京东钱包\",\"7\":\"云闪付\",\"110\":\"支付宝转银行卡\",\"112\":\"银行卡大额充值\",\"113\":\"云闪付转银行卡\",\"114\":\"离线支付宝转银行卡\",\"115\":\"微信转银行卡\",\"116\":\"微信个码\",\"999\":\"江西农商码\"}";
    public String BankPayType = "{\"1\":\"银行卡转账\",\"110\":\"支付宝转银行卡\",\"111\":\"支付宝和网银转帐\"}";
    public String BankType = "{\"\":\"选择银行类型\",\"CMB\":\"招行\",\"ICBC\":\"工行\",\"CCB\":\"建行\",\"BOC\":\"中行\",\"ABC\":\"农行\",\"BCM\":\"交行\",\"SPDB\":\"浦发\",\"CGB\":\"广发\",\"ECITI\":\"中信\",\"CEB\":\"光大\",\"CIB\":\"兴业\",\"PAB\":\"平安\",\"CMBC\":\"民生\",\"HXB\":\"华夏\",\"PSBC\":\"邮政\",\"NBB\":\"宁波\",\"BJB\":\"北京\",\"CZB\":\"浙商\"}";
    public String UserLevel = "{\"0\":\"不限\",\"999\":\"VIP0\",\"1\":\"VIP01\",\"2\":\"VIP02\",\"3\":\"VIP03\",\"4\":\"VIP04\",\"5\":\"VIP05\",\"6\":\"VIP06\",\"7\":\"VIP07\",\"8\":\"VIP08\",\"9\":\"VIP09\",\"10\":\"VIP10\",\"11\":\"VIP11\",\"12\":\"VIP12\",\"13\":\"VIP13\",\"14\":\"VIP14\",\"15\":\"VIP15\",\"16\":\"VIP16\",\"17\":\"VIP17\",\"18\":\"VIP18\",\"19\":\"VIP19\",\"20\":\"VIP20\"}";
    public String BankCardStatus = "{\"0\":\"停用\",\"1\":\"启用\",\"100\":\"在线\",\"\":\"状态\",\"-1\":\"软删除\"," +
            "\"-2\":\"预启用\",\"-3\":\"交易限额停用\",\"-4\":\"余额超额停用\",\"-5\":\"交易笔数超额停用\",\"-6\":\"未设置转出卡\"," +
            "\"-8\":\"临时停用\",\"-7\":\"异常\",\"-9\":\"已提走\" }";
    public String PayChannelStatus = "{\"0\":\"停用\",\"1\":\"启用\",\"\":\"状态\",\"-2\":\"预启用\",\"-3\":\"交易限额停用\",\"-4\":\"余额超额停用\"}";
    public String ClientType = "{\"1\":\"PC端\",\"2\":\"WAP端\",\"4\":\"APP端\"}";
    public String type = "{\"1\":\"添加\",\"2\":\"修改\",\"3\":\"删除\"}";
    public String CategoryType = "{\"Bank_Commit_In\":\"客户端-上报流水\",\"Bank_Login\":\"客户端-登录\",\"Bank_Logout\":\"客户端-登出\",\"Bank_Notify\":\"客户端-出款确认\",\"Bank_Pulse\":\"客户端-客户端心跳\",\"Bank_Register\":\"客户端-银行卡注册\",\"Bank_Withdraw\":\"客户端-抓取订单\",\"Deposit_Create\":\"服务中心-创建充值订单\",\"Deposit_Order_Paid_Success\":\"服务-充值订单完成支付\",\"DepositOrderBankCheckJob\":\"服务-充值银行卡检测任务\",\"DepositOrderNotifyJob_In\":\"服务-充值订单通知任务\",\"DepositOrderPayBankJob\":\"服务-充值银行卡核算任务\",\"DepositOrderPayChannelJob\":\"服务-充值渠道核算任务\",\"DepositOrderVoucherJob\":\"服务-充值凭证任务\",\"filterChannelWithBankCard\":\"服务-银行卡渠道查找\",\"InternalWithdrawOrderPayBankJob\":\"服务-创建内部订单\",\"MerchantDepositChannel\":\"服务-商户充值渠道查找\",\"MerchantDepositOrderJob\":\"服务-充值商户核算任务\",\"MerchantWithdrawOrderJob\":\"服务-提款商户核算任务\",\"payservice-closeorder\":\"服务-手工关闭订单任务\",\"payservice-notifyjob\":\"服务-手工推送订单任务\",\"WithdrawChannelFromBank\":\"服务-银行卡充值渠道查找\",\"WithdrawOrder_Create\":\"服务中心-创建提款订单\",\"WithDrawOrder_Paid_Success\":\"服务-提款订单完成支付\",\"WithdrawOrder_ViewC\":\"服务-提款订单查看\",\"WithdrawOrderPayBankJob\":\"服务-提款银行卡核算任务\",\"WithdrawOrderPayChannelJob\":\"服务-提款渠道核算任务\",\"WithdrawOrderVoucherJobT\":\"服务-提款凭证任务\"}";
    public String monitorStatus = "{\"\":\"请选择\",\"0\":\"不可用\",\"1\":\"可用\"}";
    public String transObject = "{\"-99\":\"请选择\",\"0\":\"对内\",\"1\":\"对外\"}";
    public String orderBy = "{\"LastUpDateTime\":\"LastUpDateTime\",\"Balance\":\"Balance\"}";
    public String CardWorkTypeCardPoolTypeRelations = "{\"1\":0,\"2\":1,\"3\":4,\"4\":2,\"5\":5,\"6\":3,\"7\":3,\"8\":3,\"9\":3,\"10\":3,\"11\":3,\"12\":3}";


    public String GMTyoe = "{\"\":\"请选择\",\"1\":\"微信\",\"2\":\"支付宝\",\"3\":\"云闪付\"}";
    public String OperatorType = "{\"\":\"请选择\",\"0\":\"中国移动\",\"1\":\"中国联通\",\"2\":\"中国电信\"}";
    public String PhoneType = "{\"\":\"请选择\",\"1\":\"个人\",\"2\":\"企业\"}";
    public String Gender = "{\"\":\"请选择\",\"0\":\"男\",\"1\":\"女\"}";
    public String Archive = "[\"请选择\",\"是\",\"否\"]";
    public String StautsType = "{\"\":\"请选择\",\"0\":\"正常\",\"1\":\"异常\",\"2\":\"已提走\",\"3\":\"补卡换卡\",\"4\":\"外借\",\"6\":\"删除\"}";
    public String RoleType = "{\"\":\"请选择\",\"0\":\"收款\",\"1\":\"出款\",\"2\":\"下发\",\"4\":\"中转\",\"5\":\"手动出款\"," +
            "\"6\":\"第四方\"}";
    public String DepositStatus = "{\"\":\"请选择\",\"0\":\"手工充值\",\"1\":\"自动充值\",\"-1\":\"系统外充值\"}";
    public String WithdrawStatus = "{\"\":\"请选择\",\"0\":\"手工下发\",\"1\":\"自动下发\",\"-1\":\"系统外下发\"}";
    public String IpStatus = "{\"\":\"请选择\",\"0\":\"停用\",\"1\":\"启用\",\"2\":\"删除\"}";
    public String MerchantStatus = "{\"0\":\"停用\",\"1\":\"启用\",\"-1\":\"软删除\"}";
    public String OrderType = "{\"0\":\"商户订单\",\"1\":\"超额内转订单\",\"2\":\"低额内转订单\",\"3\":\"充值测试转账订单\",\"4\":\"提款测试转账订单\",\"5\":\"卡异常转出金额\",\"10\":\"三方测试订单\",\"100\":\"父订单\",\"888\":\"内转代付\"}";
    public String NeizhuanStatus = "{\"\":\"请选择\",\"0\":\"创建\",\"1\":\"处理中\",\"3\":\"成功\",\"5\":\"超时\",\"7\":\"失败\"}";
    public String XiafaStatus = "{\"\":\"请选择\",\"0\":\"创建\",\"1\":\"处理中\",\"3\":\"成功\",\"6\":\"超时失败\",\"7\":\"失败\",\"8\":\"下发审核中\"}";
    public String IsUkey = "{\"\":\"请选择\",\"0\":\"是\",\"1\":\"否\"}";
    public String IsCard = "{\"\":\"请选择\",\"0\":\"是\",\"1\":\"否\"}";
    public String IsReportBad = "{\"\":\"请选择\",\"0\":\"否\",\"1\":\"是\"}";
    public String BankTypeU = "{\"0\":\"个人\",\"1\":\"企业\",\"\":\"未设置\"}";
    public String FinishTypes = "{\"A\":\"自动\",\"M\":\"手动\"}";
    public String ReviewStatus = "{\"0\":\"申请中\",\"1\":\"成功\",\"2\":\"失败\"}";

    // 银行卡客户端
    public String ClientStatus = "{\"\":\"请选择\",\"1\":\"启用\",\"0\":\"停用\",\"-1\":\"软删除\",\"100\":\"在线\",\"-100\":\"异常\"}";
    public String ClientStatusTwo = "{\"\":\"请选择\",\"1\":\"启用\",\"0\":\"停用\",\"100\":\"在线\"}";
    public String ClientWorkType = "{\"\":\"请选择\",\"1\":\"收款\",\"2\":\"出款\"}";


    //订单状态
    public String OrderStatus       = "{\"\":\"请选择\",\"0\":\"创建\",\"1\":\"处理中\",\"2\":\"清算中\",\"3\":\"成功\",\"4\":\"手工补单\",\"5\":\"超时\",\"6\":\"超时失败\",\"7\":\"失败\",\"8\":\"下发审核中\",\"11\":\"手动处理中\",\"-1\":\"挂起\"}";
    public String OrderStatusW      = "{\"\":\"请选择\",\"0\":\"创建\",\"1\":\"处理中\",\"3\":\"成功\",\"4\":\"手工补单\",\"5\":\"超时\",\"7\":\"失败\",\"11\":\"手动处理中\"}";
    public String OrderStatusD      = "{\"\":\"请选择\",\"0\":\"创建\",\"1\":\"处理中\",\"3\":\"成功\", \"5\":\"超时\",\"7\":\"失败\"}";
    public String OrderStatusDT     = "{\"\":\"请选择\",\"0\":\"创建\",\"1\":\"处理中\",\"3\":\"成功\",\"4\":\"手工补单\",\"5\":\"超时\",\"7\":\"失败\"}";
    public String handOrderStatus   = "{\"\":\"请选择\",\"0\":\"创建\",\"1\":\"处理中\",\"3\":\"成功\",\"5\":\"超时\",\"7\":\"失败\"}";
    public String CloseType         = "{\"\":\"请选择\",\"0\":\"自动\",\"1\":\"手动\"}";
    /*
        public String OrderStatusW      = "{\"\":\"请选择\",\"0\":\"创建\",\"1\":\"处理中\",\"3\":\"成功\",\"4\":\"手工补单\",\"5\":\"超时\",\"7\":\"失败\",\"-1\":\"挂起\"}";
        public String OrderStatusD      = "{\"\":\"请选择\",\"0\":\"创建\",\"3\":\"成功\",\"5\":\"超时\",\"7\":\"失败\",\"4\":\"手工补单\"}";
        public String OrderStatusDT     = "{\"\":\"请选择\",\"0\":\"创建\",\"1\":\"处理中\",\"3\":\"成功\",\"4\":\"手工补单\",\"6\":\"超时失败\",\"7\":\"失败\"}";
        public String handOrderStatus   = "{\"\":\"请选择\",\"0\":\"创建\",\"1\":\"处理中\",\"3\":\"成功\",\"4\":\"手工补单\",\"6\":\"超时失败\",\"7\":\"失败\",\"8\":\"下发审核中\",\"11\":\"手动处理中\"}";
    */
    //报表模块
    public String MerchantTransType = "{\"0\":\"充值\",\"1\":\"提款\",\"2\":\"准备金\",\"3\":\"商户下发\"}";


    public String OrderNotifyStatus = "{\"\":\"请选择\",\"0\":\"未成功通知\",\"1\":\"已成功通知\",\"2\":\"通知超时异常\"}";

}

